/* 
 * File:   swap.h
 * Author: apleilx
 */

#ifndef __SWAP_N_H_
#define	__SWAP_N_H_

#include "stdint.h"

#ifdef	__cplusplus
extern "C" {
#endif

/****************************************************************************
 * 字节内 位交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u8_with_bit(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 半字内 位交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u16_with_bit(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 字内 位交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u32_with_bit(void *p_src, void *p_des, uint16_t Len);
    
/****************************************************************************
 * 字节内 半字节交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u8_with_u4(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 半字内 半字节交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u16_with_u4(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 字内 半字节交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u32_with_u4(void *p_src, void *p_des, uint16_t Len);

/****************************************************************************
 * 半字内 字节交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u16_with_u8(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 字内 字节交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量
 * **************************************************************************/
void swap_u32_with_u8(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 列表 字节交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量 Len >= 2
 * **************************************************************************/
void swap_list_with_u8(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 列表 半字交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量 Len >= 2
 * **************************************************************************/
void swap_list_with_u16(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * 列表 字交换,p_src p_des可以同地址，但不能是其他情况的交叉区间
 * Len - 元素数量 Len >= 2
 * **************************************************************************/
void swap_list_with_u32(void *p_src, void *p_des, uint16_t Len);
/****************************************************************************
 * bit map 位行列交换   需要堆栈8bytes  转置数据长度8byte
 * **************************************************************************/
void swap_bit_map_u8(void *p_src, void *p_des);
/****************************************************************************
 * bit map 位行列交换   需要堆栈32bytes   数据地址半字对齐 转置数据长度16short
 * **************************************************************************/
void swap_bit_map_u16(void *p_src, void *p_des);
/****************************************************************************
 * bit map 位行列交换   需要堆栈128bytes  数据地址字对齐  转置数据长度32long
 * **************************************************************************/
void swap_bit_map_u32(void *p_src, void *p_des);


#ifdef	__cplusplus
}
#endif


#endif	/* __SWAP_N_H_ */

